language_text= [
    "🇷🇺 Русский",
    "🇺🇸 Английский",
    "⚙️ Адм.панель"
]

main_text_ru= [
    "🎲 Случайный фильм",
    "🏆 Топ фильмов",
    "👥 По персонам",
    "🔍 Поиск",
    "🎭 По жанрам",
    "👤 Личный кабинет"
]
main_text_en = [
    "🎲 Random Movie",
    "🏆 Top Movies",
    "👥 By People",
    "🔍 Search",
    "🎭 By Genres",
    "👤 My Profile"
]

main_top_ru = [
    {"name" :"Популярные фильмы" , "id" : "popular"},
    {"name" :"Лучшие по рейтингу", "id" : "top_rated"},
    {"name" :"Сейчас в кинотеатрах", "id" : "now_playing"}
]

main_top_en = [
    {"name" : "Popular", "id" : "popular"},
    {"name" : "Top Rated", "id" : "top_rated"},
    {"name" : "Now Playing", "id" : "now_playing"}
]

banner_text = [{"name" : "menu"},
               {"name" : "category"}]

text_admin_kb = ["Изменить баннер", "Пользователи", "Получить лог", "Реклама"]

full_categories = {
        "боевик": "💥 Боевик",
        "приключения": "🗺️ Приключения",
        "мультфильм": "🐰 Мультфильм",
        "комедия": "🎭 Комедия",
        "криминал": "🔫 Криминал",
        "документальный": "📽️ Документальный",
        "драма": "🎬 Драма",
        "семейный": "👨‍👩‍👧‍👦 Семейный",
        "фэнтези": "🧙 Фэнтези",
        "история": "📜 История",
        "ужасы": "👻 Ужасы",
        "музыка": "🎵 Музыка",
        "детектив": "🕵️ Детектив",
        "мелодрама": "💖 Мелодрама",
        "фантастика": "🚀 Фантастика",
        "телевизионный фильм": "📺 ТВ фильм",
        "триллер": "🔪 Триллер",
        "военный": "🎖️ Военный",
        "вестерн": "🤠 Вестерн"
    }
headers = {
            "Accept": "*/*",
            "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 YaBrowser/25.8.0.0 Safari/537.36"
        }

sponsor_text = "📡 Данные предоставлены The Movie Database"